export const biddings = [
  {
    title: 'رنو تلیسمان',
    address: 'عباس آباد بعد از مصلی',
    image: 'blah',
    phoneNumber: '09129129120',
    time: 'از ساعت 10 تا 13',
  },
  {
    title: 'پژو 206',
    address: 'تهرانپارس بلوار پروین',
    image: 'blah',
    phoneNumber: '09129129120',
    time: 'از ساعت 13 تا 16',
  },
  {
    title: 'هیوندا اکسنت',
    address: 'سعادت آباد بلوار فرحزاد',
    image: 'blah',
    phoneNumber: '09129129120',
    time: 'از ساعت 16 تا 19',
  },
  {
    title: 'رنو داستر',
    address: 'زعفرانیه مقدس اردبیلی',
    image: 'blah',
    phoneNumber: '09129129120',
    time: 'از ساعت 19 تا 21',
  },
];

export const CAR_INFORMATION = {
  اصلی: {
    برند: 'پژو',
    'مدل / تیپ': 'تیپ ۵ ۲۰۶',
    'کارکرد (کیلومتر)': '75000 KM',
    'سال ساخت': '۱۳۹۷',
    'وضعیت بدنه': 'سالم',
    گیربکس: 'دستی',
    'تعداد برگ سند': '1',
    دیفرانسیل: 'تک دیفرانسیل',
    'رنگ بدنه': 'سفید',
    'رنگ داخلی': 'مارون',
    'نوع سوخت': 'دوگانه سوز CNG',
    'کلید زاپاس': 'دارد',
    توضیحات:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ',
  },
  بیمه: {
    'بیمه ثالث': 'دارد',
    'تخفیف بیمه ثالث': 'دارد',
    'تاریخ مانده بیمه ثالث': 'دارد',
    'وضعیت بیمه ثالث': 'دارد',
    'بیمه بدنه': 'دارد',
    'تخفیف بیمه بدنه': 'دارد',
    'تاریخ مانده بیمه بدنه': 'دارد',
  },
  گارانتی: {
    'کیلومتر گارانتی': '40000 کیلومتر',
    'مدت گارانتی': '2 سال',
    'کارکرد گارانتی (کیلومتر)': '۴۳۷۸ کیلومتر',
    'کارکرد گارانتی (مدت زمان)': '۱ سال و ۵ ماه',
    توضیحات: 'سرویس های دوره ای هر ۱۰۰۰۰ کیلومتر',
  },
  'امکانات (آپشن)': {
    'امکانات موجود': ['عنوان آپشن', 'عنوان آپشن', 'عنوان آپشن', 'عنوان آپشن'],
    'سایر آپشن ها':
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ',
  },
  'شرایط اقساطی': {
    'نوع اقساط': 'لیزینگ',
    'تعداد اقساط باقی مانده': '36 ماه',
    'موعد پرداخت هر قسط': '3 ماهه',
    'پیش پرداخت': '33.300.000 تومان',
    'مبلغ هر قسط': '7.000.000 تومان',
    'مبلغ کل اقساط باقی مانده': '35.000.000 تومان',
    توضیحات:
      'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ',
  },
};

export const FAKE_IMAGE = 'https://picsum.photos/200';
export const FAKE_STATIONS = [
  {
    title: 'B7',
    address: 'جنب بوفه طبقه ۲',
    price: '30,000,000',
    image: FAKE_IMAGE,
  },
  {
    title: 'B8',
    address: 'جنب بوفه طبقه ۲',
    price: '30,000,000',
    image: FAKE_IMAGE,
  },
  {
    title: 'B9',
    address: 'جنب بوفه طبقه ۲',
    price: '30,000,000',
    image: FAKE_IMAGE,
  },
  {
    title: 'B10',
    address: 'جنب بوفه طبقه ۲',
    price: '30,000,000',
    image: FAKE_IMAGE,
  },
];

export const FAKE_STATIONS_SERVICE = [
  {
    image: FAKE_IMAGE,
    title: 'کارواش ۱ / ۳ دوره',
    desc: 'قیمت رزرو: 300,000 تومان',
  },
  {
    image: FAKE_IMAGE,
    title: 'کارواش 1 / 4 دوره',
    desc: 'قیمت رزرو: 300,000 تومان',
  },
  {
    image: FAKE_IMAGE,
    title: 'کارواش 1 / 5 دوره',
    desc: 'قیمت رزرو: 300,000 تومان',
  },
  {
    image: FAKE_IMAGE,
    title: 'کارواش 1 / 8 دوره',
    desc: 'قیمت رزرو: 300,000 تومان',
  },
];

export const FAKE_BAZARS = [
  {
    title: 'بازار مرکزی',
    address: 'عباس آباد بعد از مصلی',
    status: 'ظرفیت تکمیل',
    image: FAKE_IMAGE,
  },
  {
    title: 'بازار غرب',
    address: 'سعادت آباد بلوار فرحزادی',
    status: '',
    image: FAKE_IMAGE,
  },
  {
    title: 'بازار شرق',
    address: 'تهرانپارس بلوار پروین',
    status: 'در حال برگزاری',
    image: FAKE_IMAGE,
  },
];

export const FAKE_EVENTS = [
  {
    title: 'رویداد بزرگ دورهاتو',
    image: FAKE_IMAGE,
    month: 'ESFAND',
    day: '29',
  },
  {
    title: 'رویداد زیبای دورهاتو',
    image: FAKE_IMAGE,
    month: 'ABAN',
    day: '7',
  },
  {
    title: 'رویداد جذاب دورهاتو',
    image: FAKE_IMAGE,
    month: 'AZAR',
    day: '20',
  },
];

export const SERVICE_TYPE = {
  id: 0,
  name: '',
  services: [
    {
      id: 0,
      name: '',
      price: 0,
      characteristics: [''],
      image: FAKE_IMAGE,
    },
  ],
};

export const PAYMENT_DATA = {
  tracking_code: '',
  ticket_type: '',
  marketplace: '',
};
